import Brandner from '../../components/Brandner.jsx'
import FAQCollapseComponent from '../../components/FAQ/FAQCollapseComponent.jsx'

function FaqPage() {
  return (
    <div>
        <Brandner title='คำถามที่พบบ่อย'/> 

        <div className='grid grid-cols-1 md:grid-cols-2 gap-6 mx-6 my-10'>
            <FAQCollapseComponent question='ฉันจะจองนัดหมายได้อย่างไร?' answer='คุณสามารถจองนัดหมายได้โดยเลือกแพทย์ที่ต้องการ, เลือกวันที่และช่วงเวลาที่ว่าง, จากนั้นยืนยันการจอง คุณจะได้รับอีเมลยืนยันเมื่อการนัดหมายของคุณได้รับการจัดตารางเรียบร้อยแล้ว'/>
            <FAQCollapseComponent question='ฉันสามารถยกเลิกหรือเลื่อนนัดหมายได้หรือไม่?' answer='ได้ค่ะ คุณสามารถยกเลิกหรือเลื่อนนัดหมายได้ผ่านแดชบอร์ดผู้ป่วยของคุณ โปรดทราบว่าการยกเลิกหรือเลื่อนนัดหมายอาจอยู่ภายใต้นโยบายของคลินิก และอาจต้องแจ้งล่วงหน้าตามระยะเวลาที่กำหนด (เช่น 24 ชั่วโมง)'/>
            <FAQCollapseComponent question='ฉันต้องให้ข้อมูลอะไรบ้างในการจองนัดหมาย?' answer='โดยทั่วไปแล้ว คุณจะต้องระบุชื่อ-นามสกุล, เบอร์โทรศัพท์, ที่อยู่อีเมล และเหตุผลสั้นๆ สำหรับการเข้าพบแพทย์ คลินิกบางแห่งอาจขอวันเกิดหรือรหัสผู้ป่วยหากคุณเป็นผู้ป่วยเก่า'/>
            <FAQCollapseComponent question='ข้อมูลส่วนตัวและข้อมูลทางการแพทย์ของฉันปลอดภัยหรือไม่?' answer='ปลอดภัยอย่างแน่นอนค่ะ เราให้ความสำคัญกับความเป็นส่วนตัวและความปลอดภัยของข้อมูลของคุณ ข้อมูลส่วนตัวและข้อมูลทางการแพทย์ทั้งหมดจะถูกเข้ารหัสและจัดเก็บตามข้อกำหนดการปกป้องข้อมูลที่เข้มงวด (เช่น HIPAA, GDPR) เพื่อให้มั่นใจในความลับของข้อมูล'/>
            <FAQCollapseComponent question='ฉันจะค้นหาแพทย์เฉพาะทางได้อย่างไร?' answer='คุณสามารถใช้แถบค้นหาบนหน้าแรกของเรา หรือในส่วน "แพทย์" เพื่อค้นหาแพทย์ตามชื่อ, ความเชี่ยวชาญ, คลินิก หรือสถานที่ตั้ง มีตัวกรองต่างๆ เพื่อช่วยให้คุณปรับปรุงผลการค้นหาให้ละเอียดยิ่งขึ้น'/>
            <FAQCollapseComponent question='มีบริการปรึกษาออนไลน์ (Telemedicine) ด้วยหรือไม่?' answer='แพทย์หลายท่านของเรามีบริการปรึกษาออนไลน์ (Telemedicine) คุณสามารถสังเกตได้จากป้าย "Telemedicine" หรือ "ปรึกษาออนไลน์" บนโปรไฟล์ของแพทย์ คุณจะได้รับลิงก์สำหรับห้องปรึกษาเสมือนจริงก่อนถึงเวลานัดหมาย'/>
            <FAQCollapseComponent question='มีวิธีการชำระเงินแบบใดบ้างที่ยอมรับ?' answer='วิธีการชำระเงินจะแตกต่างกันไปในแต่ละคลินิก คลินิกส่วนใหญ่รับบัตรเครดิต/เดบิตหลักๆ, การโอนเงินผ่านธนาคาร, และบางแห่งอาจรับการชำระเงินโดยตรงที่คลินิก โปรดตรวจสอบโปรไฟล์ของคลินิก หรือติดต่อคลินิกโดยตรงสำหรับรายละเอียดการชำระเงินที่เฉพาะเจาะจง'/>
            <FAQCollapseComponent question='ถ้าฉันต้องการการรักษาพยาบาลเร่งด่วนควรทำอย่างไร?' answer='แพลตฟอร์มของเราออกแบบมาสำหรับการนัดหมายตามกำหนดเวลา หากคุณต้องการการรักษาพยาบาลเร่งด่วนหรือกำลังประสบภาวะฉุกเฉินทางการแพทย์ โปรดอย่าใช้บริการนี้ ให้โทรเบอร์ฉุกเฉินในพื้นที่ของคุณ หรือไปที่ห้องฉุกเฉินที่ใกล้ที่สุดทันที'/>
        </div>
    </div>
  )
}

export default FaqPage